#include <iostream>
using namespace std;

int main()
{

    // задача begin 7 та текст до консолі
    cout << "begin 7"<< endl;

    // змінна радіусу
    float R;

    // пишемо текст до терміналу
    cout << "Enter radius (R) = ";

    // запитуємо значення флоат до терміналу
    cin >> R;

    // змінна числа Пі
    float Pi = 3.14;

    // змінна математики для довжини кола
    float L = 2 * Pi*R;

    // змінна математики для площі круга
    float S = Pi * (R*R);

    // пишемо текст задачі до терміналу
    cout << "Circle length (L) = " << L << endl;
    cout << "Circle area (S) = " << S << endl;



    // задача begin 22 та текст до консолі
    cout << "begin 22" << endl;

    // змінна температури (за Фаренгейтом)
    float TF;

    // змінна температури (за Цельсієм)
    float TC;

    // текст до терміналу
    cout << "Enter temperature (TF) = ";

    // ввід тексту з терміналу до змінної
    cin >> TF;

    // математика переводу з Фаренгейтів до Цельсія
    TC = (TF-32)/1.8;

    // вивід тексту температури до терміналу
    cout << "Temperatue (TC)= " << TC << endl;



    // begin 19
    cout << "Begin 19" << endl;

    // змінна числа А
    float A;

    // текст до терміналу
    cout << "Enter number (A) = ";

    // запит вхідного значення
    cin >> A;

    // змінні степеней
    float A2, A3, A5, A10, A15;

    // знаходження степеней
    A2 = A*A;
    A3 = A*A2;
    A5 = A2*A3;
    A10 = A5*A5;
    A15 = A10*A5;

    // вивід до терміналу
    cout << "A^2 = " << A2 << ", A^3 = " << A3 << ", A^5 = " << A5 << ", A^10 = " << A10 << ", A^15 = " << A15 << endl;


    return 0;
}
